{\rtf1\ansi\ansicpg1252\cocoartf1504\cocoasubrtf760
{\fonttbl\f0\fnil\fcharset0 Menlo-Regular;\f1\fnil\fcharset134 PingFangSC-Regular;\f2\fnil\fcharset0 Menlo-Bold;
}
{\colortbl;\red255\green255\blue255;\red0\green0\blue0;\red255\green255\blue255;}
{\*\expandedcolortbl;;\csgray\c0;\csgray\c100000;}
\margl1440\margr1440\vieww19860\viewh10520\viewkind0
\pard\tx560\tx1120\tx1680\tx2240\tx2800\tx3360\tx3920\tx4480\tx5040\tx5600\tx6160\tx6720\pardirnatural\partightenfactor0

\f0\fs22 \cf2 \cb3 \CocoaLigature0 \
root@beaglebone:~# sudo connmanctl\
\
connmanctl> enable wifi\
\
connmanctl> scan wifi\
\
connmanctl> services	     
\f1 //to see all the result of my scan wifi command
\f0 \
    BeagleBone090230     wifi_2cf7f1066b55_426561676c65426f6e65303930323330_managed_none\
    BeagleBone090376     wifi_2cf7f1066b55_426561676c65426f6e65303930333736_managed_none\
    UCLA_WIFI            wifi_2cf7f1066b55_55434c415f57494649_managed_none\
    eduroam              wifi_2cf7f1066b55_656475726f616d_managed_ieee8021x\
    UCLA_WEB             wifi_2cf7f1066b55_55434c415f574542_managed_none\
connmanctl> agent on\
\
connmanctl> connect wifi_2cf7f1066b55_55434c415f57494649_managed_none\
\
Connected wifi_2cf7f1066b55_55434c415f57494649_managed_none\
\
connmanctl> quit\
root@beaglebone:~# ifconfig\
SoftAp0   Link encap:Ethernet  HWaddr c8:fd:19:c6:0a:2f  \
          inet addr:192.168.8.1  Bcast:192.168.8.255  Mask:255.255.255.0\
          inet6 addr: fe80::cafd:19ff:fec6:a2f/64 Scope:Link\
          UP BROADCAST RUNNING MULTICAST  MTU:1500  Metric:1\
          RX packets:0 errors:0 dropped:0 overruns:0 frame:0\
          TX packets:34 errors:0 dropped:0 overruns:0 carrier:0\
          collisions:0 txqueuelen:1000 \
          RX bytes:0 (0.0 B)  TX bytes:8137 (7.9 KiB)\
\
lo        Link encap:Local Loopback  \
          inet addr:127.0.0.1  Mask:255.0.0.0\
          inet6 addr: ::1/128 Scope:Host\
          UP LOOPBACK RUNNING  MTU:65536  Metric:1\
          RX packets:256 errors:0 dropped:0 overruns:0 frame:0\
          TX packets:256 errors:0 dropped:0 overruns:0 carrier:0\
          collisions:0 txqueuelen:1 \
          RX bytes:20463 (19.9 KiB)  TX bytes:20463 (19.9 KiB)\
\
usb0      Link encap:Ethernet  HWaddr c8:fd:19:c6:0a:20  \
          inet addr:192.168.7.2  Bcast:192.168.7.255  Mask:255.255.255.0\
          inet6 addr: fe80::cafd:19ff:fec6:a20/64 Scope:Link\
          UP BROADCAST RUNNING MULTICAST  MTU:1500  Metric:1\
          RX packets:338 errors:0 dropped:0 overruns:0 frame:0\
          TX packets:227 errors:0 dropped:0 overruns:0 carrier:0\
          collisions:0 txqueuelen:1000 \
          RX bytes:28867 (28.1 KiB)  TX bytes:42618 (41.6 KiB)\
\
wlan0     Link encap:Ethernet  HWaddr 2c:f7:f1:06:6b:55  \
          
\f2\b inet addr:172.30.74.54
\f0\b0   Bcast:172.30.75.255  Mask:255.255.252.0\
          inet6 addr: fe80::2ef7:f1ff:fe06:6b55/64 Scope:Link\
          UP BROADCAST RUNNING MULTICAST DYNAMIC  MTU:1500  Metric:1\
          RX packets:2218 errors:0 dropped:0 overruns:0 frame:0\
          TX packets:464 errors:0 dropped:0 overruns:0 carrier:0\
          collisions:0 txqueuelen:1000 \
          RX bytes:227051 (221.7 KiB)  TX bytes:59531 (58.1 KiB)\
\
//the bold font line is what we need for connection\
\
root@beaglebone:~# sudo apt-get update\
\
Get:1 http://repos.rcn-ee.com jessie InRelease [172 B]\
Get:2 http://httpredir.debian.org jessie InRelease [176 B]                     \
Get:3 http://httpredir.debian.org jessie-updates InRelease [184 B]             \
99% [1 InRelease gpgv 172 B] [Connecting to security.debian.org (128.61.240.73)Splitting up /var/lib/apt/lists/partial/repos.rcn-ee.com_debian_dists_jessie_InReIgn http://repos.rcn-ee.com jessie InRelease                                   \
E: GPG error: http://repos.rcn-ee.com jessie InRelease: Clearsigned file isn't valid, got 'NODATA' (does the network require authentication?)\
\
root@beaglebone:~# sudo apt-get install xauth\
Reading package lists... Done\
Building dependency tree       \
Reading state information... Done\
Package xauth is not available, but is referred to by another package.\
This may mean that the package is missing, has been obsoleted, or\
is only available from another source\
\
E: Package 'xauth' has no installation candidate\
\
root@beaglebone:~# apt-get install firefox-esr-l10n-en-gb\
Reading package lists... Done\
Building dependency tree       \
Reading state information... Done\
E: Unable to locate package firefox-esr-l10n-en-gb\
\
//I try to install firefox on this computer, but I failed, so I change this board to be client.\
\
//then I use a personal hotspot on my phone as wifi source\
\
connmanctl> scan wifi\
\
connmanctl> services\
*A  UCLA_WIFI            wifi_2cf7f1066b54_55434c415f57494649_managed_none\
*A  UCLA_WEB             wifi_2cf7f1066b54_55434c415f574542_managed_none\
    AndroidAP            wifi_2cf7f1066b54_416e64726f69644150_managed_psk\
    BeagleBone090230     wifi_2cf7f1066b54_426561676c65426f6e65303930323330_managed_none\
    AndroidAP            wifi_2cf7f1066b54_416e64726f69644150_managed_none\
    BeagleBone090376     wifi_2cf7f1066b54_426561676c65426f6e65303930333736_managed_none\
    eduroam              wifi_2cf7f1066b54_656475726f616d_managed_ieee8021x\
    soc-secure           wifi_2cf7f1066b54_736f632d736563757265_managed_psk\
connmanctl> connect wifi_2cf7f1066b54_416e64726f69644150_managed_none\
Connected wifi_2cf7f1066b54_416e64726f69644150_managed_none\
connmanctl> quit\
\
\
\
//generate key\
\
root@beaglebone:~# ssh-keygen\
Generating public/private rsa key pair.\
Enter file in which to save the key (/root/.ssh/id_rsa): \
Created directory '/root/.ssh'.\
Enter passphrase (empty for no passphrase): \
Enter same passphrase again: \
Your identification has been saved in /root/.ssh/id_rsa.\
Your public key has been saved in /root/.ssh/id_rsa.pub.\
The key fingerprint is:\
f6:94:bc:7b:e9:4f:b7:e5:c2:6e:81:31:e3:da:7c:86 root@beaglebone\
The key's randomart image is:\
+---[RSA 2048]----+\
|                 |\
|                 |\
|                 |\
|         . .+    |\
|        S +. =   |\
|       . o .o .  |\
|          o+ +..o|\
|          ..E.*oo|\
|          .o.*oo.|\
+-----------------+\
\
\
root@beaglebone:~# ifconfig\
SoftAp0   Link encap:Ethernet  HWaddr c8:fd:19:c6:0a:2f  \
          inet addr:192.168.8.1  Bcast:192.168.8.255  Mask:255.255.255.0\
          inet6 addr: fe80::cafd:19ff:fec6:a2f/64 Scope:Link\
          UP BROADCAST RUNNING MULTICAST  MTU:1500  Metric:1\
          RX packets:0 errors:0 dropped:0 overruns:0 frame:0\
          TX packets:87 errors:0 dropped:0 overruns:0 carrier:0\
          collisions:0 txqueuelen:1000 \
          RX bytes:0 (0.0 B)  TX bytes:21190 (20.6 KiB)\
\
lo        Link encap:Local Loopback  \
          inet addr:127.0.0.1  Mask:255.0.0.0\
          inet6 addr: ::1/128 Scope:Host\
          UP LOOPBACK RUNNING  MTU:65536  Metric:1\
          RX packets:378 errors:0 dropped:0 overruns:0 frame:0\
          TX packets:378 errors:0 dropped:0 overruns:0 carrier:0\
          collisions:0 txqueuelen:1 \
          RX bytes:30403 (29.6 KiB)  TX bytes:30403 (29.6 KiB)\
\
usb0      Link encap:Ethernet  HWaddr c8:fd:19:c6:0a:20  \
          inet addr:192.168.7.2  Bcast:192.168.7.255  Mask:255.255.255.0\
          inet6 addr: fe80::cafd:19ff:fec6:a20/64 Scope:Link\
          UP BROADCAST RUNNING MULTICAST  MTU:1500  Metric:1\
          RX packets:1910 errors:0 dropped:0 overruns:0 frame:0\
          TX packets:1348 errors:0 dropped:0 overruns:0 carrier:0\
          collisions:0 txqueuelen:1000 \
          RX bytes:156920 (153.2 KiB)  TX bytes:225711 (220.4 KiB)\
\
wlan0     Link encap:Ethernet  HWaddr 2c:f7:f1:06:6b:54  \
         
\f2\b  inet addr:192.168.43.118
\f0\b0   Bcast:192.168.43.255  Mask:255.255.255.0\
          inet6 addr: fe80::2ef7:f1ff:fe06:6b54/64 Scope:Link\
          UP BROADCAST RUNNING MULTICAST DYNAMIC  MTU:1500  Metric:1\
          RX packets:779 errors:0 dropped:0 overruns:0 frame:0\
          TX packets:573 errors:0 dropped:0 overruns:0 carrier:0\
          collisions:0 txqueuelen:1000 \
          RX bytes:100262 (97.9 KiB)  TX bytes:101359 (98.9 KiB)\
\
\
//log in to another BeagleBone\
root@beaglebone:~# ssh-copy-id -i yzm@192.168.43.86\
The authenticity of host '192.168.43.86 (192.168.43.86)' can't be established.\
ECDSA key fingerprint is 4b:50:06:d2:4b:93:4e:b6:28:5f:4e:97:a3:06:98:95.\
Are you sure you want to continue connecting (yes/no)? yes\
/usr/bin/ssh-copy-id: INFO: attempting to log in with the new key(s), to filter out any that are already installed\
/usr/bin/ssh-copy-id: INFO: 1 key(s) remain to be installed -- if you are prompted now it is to install the new keys\
Debian GNU/Linux 8\
\
BeagleBoard.org Debian Image 2016-06-14\
\
Support/FAQ: http://elinux.org/Beagleboard:BeagleBoneBlack_Debian\
\
default username:password is [debian:temppwd]\
\
yzm@192.168.43.86's password: \
\
Number of key(s) added: 1\
\
Now try logging into the machine, with:   "ssh 'yzm@192.168.43.86'"\
and check to make sure that only the key(s) you wanted were added.\
\
root@beaglebone:~# eval ssh-agent -s\
SSH_AUTH_SOCK=/tmp/ssh-97Mc4OpHr3Rx/agent.1487; export SSH_AUTH_SOCK;\
SSH_AGENT_PID=1488; export SSH_AGENT_PID;\
echo Agent pid 1488;\
root@beaglebone:~# eval $(ssh-agent)\
Agent pid 1494\
root@beaglebone:~# ssh-add\
Identity added: /root/.ssh/id_rsa (rsa w/o comment)\
root@beaglebone:~# ssh yzm@192.168.43.86\
Debian GNU/Linux 8\
\
BeagleBoard.org Debian Image 2016-06-14\
\
Support/FAQ: http://elinux.org/Beagleboard:BeagleBoneBlack_Debian\
\
default username:password is [debian:temppwd]\
\
$ ls\
$ pwd\
/home/yzm\
$ firefox\
Error: GDK_BACKEND does not match available displays\
$ \
//because I\'92m using default terminal in Mac, so I don\'92t have the -X version. So I can\'92t open the firefox here. \
\
For Host:\
\
ssh root@192.168.7.2\
sudo connmanctl\
connmanctl> scan wifi\
connmanctl> services\
\
*AO UCLA_WEB             wifi_2cf7f1066a17_55434c415f574542_managed_none\
    BeagleBone090184     wifi_2cf7f1066a17_426561676c65426f6e65303930313834_\
managed_none\
    CR3760-wifi          wifi_2cf7f1066a17_4352333736302d77696669_managed_psk\
    BeagleBone090348     wifi_2cf7f1066a17_426561676c65426f6e65303930333438\
_managed_none\
    NESL-2.4             wifi_2cf7f1066a17_4e45534c2d322e34_managed_psk\
    UCLA_WIFI            wifi_2cf7f1066a17_55434c415f57494649_managed_none\
    eduroam              wifi_2cf7f1066a17_656475726f616d_managed_ieee8021x\
    RICE ROOM            wifi_2cf7f1066a17_5249434520524f4f4d_managed_psk\
\
connmanctl> agent on\
connmanctl> connect wifi_2cf7f1066a17_4352333736302d77696669_managed_psk\
connmanctl> quit\
\
root@beaglebone:~# ifconfig\
And I get my IP address: inet addr:10.97.85.152\
\
To check that all needed applications are installed\
root@beaglebone:~# dpkg --get-selections | grep openssh\
openssh-client	   	install\
openssh-server		install\
openssh-sftp-server	install\
\
Server\
1. Test ping to partner\
ping 10.97.85.157\
2. Generate a key with default selection(location and no passpharse)\
ssh-keygen\
\
Generating public/private rsa key pair.\
Enter file in which to save the key (/root/.ssh/id_rsa):\
Created directory '/root/.ssh'.\
Enter passphrase (empty for no passphrase):\
Enter same passphrase again:\
\
3. Create a user name for my partner\
sudo useradd -d /home/fyj -m fyj\
4. Create password for yzm\
sudo passwd fyj\
\
Enter new UNIX password:\
Retype new UNIX password:\
passwd: password updated successfully\
\
5. \
cd /home/fyj\
6. Create a directory for my partner\
sudo mkdir .ssh\
7. Change the ownership as my partner\
sudo chown -R fyj .ssh\
8. Give my partner permission\
sudo chmod 700 .ssh\
\
}